IDEA Open Model
LoadCaseType Enumeration
Compatible with IDEA StatiCa v 10.1
 Load case type
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public enum LoadCaseType
Public Enumeration LoadCaseType
public enum class LoadCaseType
Members
Member name | Value | Description
Permanent | 0 |  Permanent
Variable | 1 |  Variable
Accidental | 2 |  Accidental
Nonlinear | 5 |  Loadcase is for nonlinear analysis
See Also
Reference
IdeaRS.OpenModel.Loading Namespace